# Lab 6 - More Fun with Pandas

**Import the pandas library**

In [17]:
import pandas as pd

### **1.** Import the dataset below to a variable called 'users'.

'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'

The data is separated with | and the index column is called 'user_id'

In [32]:
df = pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user", sep = "|", index_col = "user_id")

**1.2.** Take a look at the last 10 entries to check the data loaded correctly.

In [6]:
df.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

**1.3.** What is the size of the dataset, in terms of both observations and variables?

In [7]:
df.shape

(943, 4)

**1.5.** What is the data type of each column?

In [12]:
# df.dtypes
df.info()

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

**1.6.** Extract just the occupations, what type of data is this?

In [19]:
df['occupation'].info()

<class 'pandas.core.series.Series'>
Int64Index: 943 entries, 1 to 943
Series name: occupation
Non-Null Count  Dtype
--------------  -----
943 non-null    object
dtypes: object(1)
memory usage: 14.7+ KB

**1.7.** The zip code data may be giving away personal data, extract all the other columns into a new variable. What is this datatype?

In [26]:
# df = df - df['zip_code']
# df.drop(columns=["zip_code"], inplace=True)
# df.drop("zip_code", axis=1)

         age gender     occupation
user_id
1         24      M     technician
2         53      F          other
3         23      M         writer
4         24      M     technician
5         33      F          other
...      ...    ...            ...
939       26      F        student
940       32      M  administrator
941       20      M        student
942       48      F      librarian
943       22      M        student

[943 rows x 3 columns]

* *1.8.** How many different occupations are in this dataset?

In [27]:
df['occupation'].unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

**1.9.** Convert the occupation column to upper case, to ensure different use of capital letters doesn't result in different occupations.

In [33]:
df['occupation'] = df['occupation'].str.upper()
df

         age gender     occupation zip_code
user_id
1         24      M     TECHNICIAN    85711
2         53      F          OTHER    94043
3         23      M         WRITER    32067
4         24      M     TECHNICIAN    43537
5         33      F          OTHER    15213
...      ...    ...            ...      ...
939       26      F        STUDENT    33319
940       32      M  ADMINISTRATOR    02215
941       20      M        STUDENT    97229
942       48      F      LIBRARIAN    78209
943       22      M        STUDENT    77841

[943 rows x 4 columns]

**1.10.** Discover what is the mean age per occupation

In [35]:
df.groupby('occupation')['age'].mean()

occupation
ADMINISTRATOR    38.746835
ARTIST           31.392857
DOCTOR           43.571429
EDUCATOR         42.010526
ENGINEER         36.388060
ENTERTAINMENT    29.222222
EXECUTIVE        38.718750
HEALTHCARE       41.562500
HOMEMAKER        32.571429
LAWYER           36.750000
LIBRARIAN        40.000000
MARKETING        37.615385
NONE             26.555556
OTHER            34.523810
PROGRAMMER       33.121212
RETIRED          63.071429
SALESMAN         35.666667
SCIENTIST        35.548387
STUDENT          22.081633
TECHNICIAN       33.148148
WRITER           36.311111
Name: age, dtype: float64

**1.11.** Discover the Male ratio per occupation and sort it from the most to the least

In [49]:
df.groupby('occupation')['gender'].value_counts(normalize=True).unstack().pop("M").sort_values(ascending=False)

occupation
DOCTOR           1.000000
ENGINEER         0.970149
TECHNICIAN       0.962963
RETIRED          0.928571
PROGRAMMER       0.909091
EXECUTIVE        0.906250
SCIENTIST        0.903226
ENTERTAINMENT    0.888889
LAWYER           0.833333
SALESMAN         0.750000
EDUCATOR         0.726316
STUDENT          0.693878
OTHER            0.657143
MARKETING        0.615385
WRITER           0.577778
NONE             0.555556
ADMINISTRATOR    0.544304
ARTIST           0.535714
LIBRARIAN        0.431373
HEALTHCARE       0.312500
HOMEMAKER        0.142857
Name: M, dtype: float64

**1.12** For each occupation, calculate the minimum and maximum ages

In [43]:
df.groupby('occupation')['age'].agg(['min', 'max'])

               min  max
occupation
ADMINISTRATOR   21   70
ARTIST          19   48
DOCTOR          28   64
EDUCATOR        23   63
ENGINEER        22   70
ENTERTAINMENT   15   50
EXECUTIVE       22   69
HEALTHCARE      22   62
HOMEMAKER       20   50
LAWYER          21   53
LIBRARIAN       23   69
MARKETING       24   55
NONE            11   55
OTHER           13   64
PROGRAMMER      20   63
RETIRED         51   73
SALESMAN        18   66
SCIENTIST       23   55
STUDENT          7   42
TECHNICIAN      21   55
WRITER          18   60

**1.13.** For each combination of occupation and gender, calculate the mean age

In [48]:
df.groupby(['occupation','gender'])['age'].agg('mean')

occupation     gender
ADMINISTRATOR  F         40.638889
               M         37.162791
ARTIST         F         30.307692
               M         32.333333
DOCTOR         M         43.571429
EDUCATOR       F         39.115385
               M         43.101449
ENGINEER       F         29.500000
               M         36.600000
ENTERTAINMENT  F         31.000000
               M         29.000000
EXECUTIVE      F         44.000000
               M         38.172414
HEALTHCARE     F         39.818182
               M         45.400000
HOMEMAKER      F         34.166667
               M         23.000000
LAWYER         F         39.500000
               M         36.200000
LIBRARIAN      F         40.000000
               M         40.000000
MARKETING      F         37.200000
               M         37.875000
NONE           F         36.500000
               M         18.600000
OTHER          F         35.472222
               M         34.028986
PROGRAMMER     F         32.166667
               M         33.216667
RETIRED        F         70.000000
               M         62.538462
SALESMAN       F         27.000000
               M         38.555556
SCIENTIST      F         28.333333
               M         36.321429
STUDENT        F         20.750000
               M         22.669118
TECHNICIAN     F         38.000000
               M         32.961538
WRITER         F         37.631579
               M         35.346154
Name: age, dtype: float64

**1.14.** For each occupation present the percentage of women and men.

In [66]:
# create a data frame and apply count to gender
df.groupby('occupation')['gender'].value_counts(normalize=True).unstack()*100

gender                 F           M
occupation
ADMINISTRATOR  45.569620   54.430380
ARTIST         46.428571   53.571429
DOCTOR               NaN  100.000000
EDUCATOR       27.368421   72.631579
ENGINEER        2.985075   97.014925
ENTERTAINMENT  11.111111   88.888889
EXECUTIVE       9.375000   90.625000
HEALTHCARE     68.750000   31.250000
HOMEMAKER      85.714286   14.285714
LAWYER         16.666667   83.333333
LIBRARIAN      56.862745   43.137255
MARKETING      38.461538   61.538462
NONE           44.444444   55.555556
OTHER          34.285714   65.714286
PROGRAMMER      9.090909   90.909091
RETIRED         7.142857   92.857143
SALESMAN       25.000000   75.000000
SCIENTIST       9.677419   90.322581
STUDENT        30.612245   69.387755
TECHNICIAN      3.703704   96.296296
WRITER         42.222222   57.777778

In [58]:
# create a DataFrame and apply count for each occupation
occup_count = df['occupation'].value_counts()

In [59]:
# divide the gender_ocup per the occup_count and multiply per 100
gender_ocup / occup_count

ADMINISTRATOR   NaN
ARTIST          NaN
DOCTOR          NaN
EDUCATOR        NaN
ENGINEER        NaN
ENTERTAINMENT   NaN
EXECUTIVE       NaN
F               NaN
HEALTHCARE      NaN
HOMEMAKER       NaN
LAWYER          NaN
LIBRARIAN       NaN
M               NaN
MARKETING       NaN
NONE            NaN
OTHER           NaN
PROGRAMMER      NaN
RETIRED         NaN
SALESMAN        NaN
SCIENTIST       NaN
STUDENT         NaN
TECHNICIAN      NaN
WRITER          NaN
dtype: float64

In [ ]:
# present all rows from the 'gender column'

### **2.** Import the following .csv file of student drinking behaviour.

'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/Students_Alcohol_Consumption/student-mat.csv'

In [60]:
df_drink = pd.read_csv("https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/Students_Alcohol_Consumption/student-mat.csv")

**2.1.** For the purpose of this exercise slice the dataframe from 'school' until the 'guardian' column.

In [67]:
df_drink.loc[:,'school':'guardian']

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,reason,guardian
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,course,mother
1,GP,F,17,U,GT3,T,1,1,at_home,other,course,father
2,GP,F,15,U,LE3,T,1,1,at_home,other,other,mother
3,GP,F,15,U,GT3,T,4,2,health,services,home,mother
4,GP,F,16,U,GT3,T,3,3,other,other,home,father
...,...,...,...,...,...,...,...,...,...,...,...,...
390,MS,M,20,U,LE3,A,2,2,services,services,course,other
391,MS,M,17,U,LE3,T,3,1,services,services,course,mother
392,MS,M,21,R,GT3,T,1,1,other,other,course,other
393,MS,M,18,R,LE3,T,3,2,services,other,course,mother
394,MS,M,19,U,LE3,T,1,1,other,at_home,course,father

**2.2.** Create a function that will capitalize strings. Use the function to capitalise the columns Mjob and FJob.

In [69]:
def capitalize(serie):
    serie = serie.str.capitalize()

d

0       At_home
1       At_home
2       At_home
3        Health
4         Other
         ...
390    Services
391    Services
392       Other
393    Services
394       Other
Name: Mjob, Length: 395, dtype: object

**2.3.** Create a function called can_drink that returns a boolean value if the the student should be allowed to dink (age 18+). Add a column to the dataset "legal_drinker" to indicate which students should be allowed to drink, add this column after the age column.